# from fastapi import FastAPI, UploadFile, File, HTTPException, APIRouter
# import json
# import re

from typing import Dict, Any

# import os
# from pathlib import Path
# import shutil

# from gigachat import GigaChat
# from gigachat.models import Chat, Messages, MessagesRole
from sqlalchemy.ext.asyncio import AsyncSession
from app.TablePakage.model.database import get_db
import requests
import json
import base64
import openai
from openai import OpenAI
from openai import AsyncOpenAI
from fastapi import APIRouter, Depends, Body, Response, Cookie, Request
from fastapi.responses import FileResponse
from fastapi import UploadFile, File, HTTPException
from fastapi.responses import JSONResponse
import time
from fastapi import Request, HTTPException, status
import os
from dotenv import load_dotenv

from ..utils.convert_ol_file import get_params_and_values_of_product, convert_file_to_jpeg_content
from ..utils.promt_ol import get_promt

load_dotenv()
#делаю изменения
key_api = os.getenv("key_api")
model_type = os.getenv("model_type")
vseGPTurl = os.getenv("vseGPTurl")

client = OpenAI(api_key = key_api, base_url=vseGPTurl) 

router = APIRouter(prefix="/AI", tags=[""])

# client_id = "019cfb75-d657-765b-9e14-8d227ea7449d"
# scope= "GIGACHAT_API_PERS"
# API_KEY = "MDE5Y2ZiNzUtZDY1Ny03NjViLTllMTQtOGQyMjdlYTc0NDlkOmM4YzBlMWFlLWJkNDAtNDM0MC05YmUzLTFkOThmYzU0ZWRlMg=="

# SUPER_PROMPT = """
# Мне нужно собрать json по шаблону:
# ```
# {
#     "Устройство принудительного открытия" : [
#         "не требуется",
#         "требуется"
#       ],
#     "Сильфон" : [
#         "не требуется",
#         "требуется"
#       ],
#     "Тип конструкции" : [
#         "Клапан пружинный",
#         "Клапан пружинный с устройством принудительного открытия",
#         "Клапан пружинный сильфонный",
#         "Клапан пружинный сильфонный с устройством принудительного открытия"
#       ],
#     "Номинальный диаметр" : [
#         "100",
#         "150",
#         "200",
#         "25",
#         "50",
#         "80"
#       ],
#     "Номинальное давление" : [
#         "100",
#         "16",
#         "160",
#         "40",
#         "63"
#       ],
#     "Тип присоединения к трубопроводу" : "фланцевое",
#     "Тип уплотнения затвора" : "металл-металл",
#     "Материал корпуса" : [
#         "нержавеющая сталь  (12Х18Н9ТЛ)",
#         "углеродистая сталь (25Л)",
#         "хладостойкая сталь (20ГЛ)"
#       ],
#     "По способу сброса рабочей среды ": "открытого типа",
#     "Упаковка : "на поддон",
#     "Наличие КОФ" : "без КОФ",
#     "Наличие ЗИП" : "без ЗИП",
#     Маркировка : [
#         "АМ211.100.16.3310",
#         "АМ211.100.16.3320",
#         "АМ211.100.16.3330",
#         "АМ211.100.160.3310",
#         "АМ211.100.160.3320",
#         "АМ211.100.160.3330",
#         "АМ211.100.40.3310",
#         "АМ211.100.40.3320",
#         "АМ211.100.40.3330",
#         "АМ211.100.63.3310",
#         "АМ211.100.63.3320",
#         "АМ211.100.63.3330",
#         "АМ211.150.16.3310",
#         "АМ211.150.16.3320",
#         "АМ211.150.16.3330",
#         "АМ211.150.40.3310",
#         "АМ211.150.40.3320",
#         "АМ211.150.40.3330",
#         "АМ211.200.16.3310",
#         "АМ211.200.16.3320",
#         "АМ211.200.16.3330",
#         "АМ211.25.100.3310",
#         "АМ211.25.100.3320",
#         "АМ211.25.100.3330",
#         "АМ211.25.160.3310",
#         "АМ211.25.160.3320",
#         "АМ211.25.160.3330",
#         "АМ211.25.40.3310",
#         "АМ211.25.40.3320",
#         "АМ211.25.40.3330",
#         "АМ211.50.16.3310",
#         "АМ211.50.16.3320",
#         "АМ211.50.16.3330",
#         "АМ211.50.160.3310",
#         "АМ211.50.160.3320",
#         "АМ211.50.160.3330",
#         "АМ211.50.40.3310",
#         "АМ211.50.40.3320",
#         "АМ211.50.40.3330",
#         "АМ211.50.63.3310",
#         "АМ211.50.63.3320",
#         "АМ211.50.63.3330",
#         "АМ211.80.16.3310",
#         "АМ211.80.16.3320",
#         "АМ211.80.16.3330",
#         "АМ211.80.160.3310",
#         "АМ211.80.160.3320",
#         "АМ211.80.160.3330",
#         "АМ211.80.40.3310",
#         "АМ211.80.40.3320",
#         "АМ211.80.40.3330",
#         "АМ211.80.63.3310",
#         "АМ211.80.63.3320",
#         "АМ211.80.63.3330",
#         "АМ212.100.16.3310",
#         "АМ212.100.16.3320",
#         "АМ212.100.16.3330",
#         "АМ212.100.160.3310",
#         "АМ212.100.160.3320",
#         "АМ212.100.160.3330",
#         "АМ212.100.40.3310",
#         "АМ212.100.40.3320",
#         "АМ212.100.40.3330",
#         "АМ212.100.63.3310",
#         "АМ212.100.63.3320",
#         "АМ212.100.63.3330",
#         "АМ212.150.16.3310",
#         "АМ212.150.16.3320",
#         "АМ212.150.16.3330",
#         "АМ212.150.40.3310",
#         "АМ212.150.40.3320",
#         "АМ212.150.40.3330",
#         "АМ212.200.16.3310",
#         "АМ212.200.16.3320",
#         "АМ212.200.16.3330",
#         "АМ212.25.100.3310",
#         "АМ212.25.100.3320",
#         "АМ212.25.100.3330",
#         "АМ212.25.160.3320",
#         "АМ212.25.160.3330",
#         "АМ212.25.40.3310",
#         "АМ212.25.40.3320",
#         "АМ212.25.40.3330",
#         "АМ212.50.16.3310",
#         "АМ212.50.16.3320",
#         "АМ212.50.16.3330",
#         "АМ212.50.160.3310",
#         "АМ212.50.160.3320",
#         "АМ212.50.160.3330",
#         "АМ212.50.40.3310",
#         "АМ212.50.40.3320",
#         "АМ212.50.40.3330",
#         "АМ212.50.63.3310",
#         "АМ212.50.63.3320",
#         "АМ212.50.63.3330",
#         "АМ212.80.16.3310",
#         "АМ212.80.16.3320",
#         "АМ212.80.16.3330",
#         "АМ212.80.160.3310",
#         "АМ212.80.160.3320",
#         "АМ212.80.160.3330",
#         "АМ212.80.40.3310",
#         "АМ212.80.40.3320",
#         "АМ212.80.40.3330",
#         "АМ212.80.63.3310",
#         "АМ212.80.63.3320",
#         "АМ212.80.63.3330",
#         "АМ213.100.100.3310",
#         "АМ213.100.100.3320",
#         "АМ213.100.100.3330",
#         "АМ213.100.16.3310",
#         "АМ213.100.16.3320",
#         "АМ213.100.16.3330",
#         "АМ213.100.160.3310",
#         "АМ213.100.160.3320",
#         "АМ213.100.160.3330",
#         "АМ213.100.40.3310",
#         "АМ213.100.40.3320",
#         "АМ213.100.40.3330",
#         "АМ213.100.63.3310",
#         "АМ213.100.63.3320",
#         "АМ213.100.63.3330",
#         "АМ213.150.16.3310",
#         "АМ213.150.16.3320",
#         "АМ213.150.16.3330",
#         "АМ213.150.40.3310",
#         "АМ213.150.40.3320",
#         "АМ213.150.40.3330",
#         "АМ213.200.16.3310",
#         "АМ213.200.16.3320",
#         "АМ213.200.16.3330",
#         "АМ213.25.100.3310",
#         "АМ213.25.100.3320",
#         "АМ213.25.100.3330",
#         "АМ213.25.160.3310",
#         "АМ213.25.160.3320",
#         "АМ213.25.160.3330",
#         "АМ213.25.40.3310",
#         "АМ213.25.40.3320",
#         "АМ213.25.40.3330",
#         "АМ213.50.16.3310",
#         "АМ213.50.16.3320",
#         "АМ213.50.16.3330",
#         "АМ213.50.160.3310",
#         "АМ213.50.160.3320",
#         "АМ213.50.160.3330",
#         "АМ213.50.40.3310",
#         "АМ213.50.40.3320",
#         "АМ213.50.40.3330",
#         "АМ213.50.63.3310",
#         "АМ213.50.63.3320",
#         "АМ213.50.63.3330",
#         "АМ213.80.16.3310",
#         "АМ213.80.16.3320",
#         "АМ213.80.16.3330",
#         "АМ213.80.160.3310",
#         "АМ213.80.160.3320",
#         "АМ213.80.160.3330",
#         "АМ213.80.40.3310",
#         "АМ213.80.40.3320",
#         "АМ213.80.40.3330",
#         "АМ213.80.63.3310",
#         "АМ213.80.63.3320",
#         "АМ213.80.63.3330",
#         "АМ214.100.100.3310",
#         "АМ214.100.100.3320",
#         "АМ214.100.100.3330",
#         "АМ214.100.16.3310",
#         "АМ214.100.16.3320",
#         "АМ214.100.16.3330",
#         "АМ214.100.160.3310",
#         "АМ214.100.160.3320",
#         "АМ214.100.160.3330",
#         "АМ214.100.40.3310",
#         "АМ214.100.40.3320",
#         "АМ214.100.40.3330",
#         "АМ214.100.63.3310",
#         "АМ214.100.63.3320",
#         "АМ214.100.63.3330",
#         "АМ214.150.16.3310",
#         "АМ214.150.16.3320",
#         "АМ214.150.16.3330",
#         "АМ214.150.40.3310",
#         "АМ214.150.40.3320",
#         "АМ214.150.40.3330",
#         "АМ214.200.16.3310",
#         "АМ214.200.16.3320",
#         "АМ214.200.16.3330",
#         "АМ214.25.100.3310",
#         "АМ214.25.100.3320",
#         "АМ214.25.100.3330",
#         "АМ214.25.160.3310",
#         "АМ214.25.160.3320",
#         "АМ214.25.160.3330",
#         "АМ214.25.40.3310",
#         "АМ214.25.40.3320",
#         "АМ214.25.40.3330",
#         "АМ214.50.16.3310",
#         "АМ214.50.16.3320",
#         "АМ214.50.16.3330",
#         "АМ214.50.160.3310",
#         "АМ214.50.160.3320",
#         "АМ214.50.160.3330",
#         "АМ214.50.40.3310",
#         "АМ214.50.40.3320",
#         "АМ214.50.40.3330",
#         "АМ214.50.63.3310",
#         "АМ214.50.63.3320",
#         "АМ214.50.63.3330",
#         "АМ214.80.16.3310",
#         "АМ214.80.16.3320",
#         "АМ214.80.16.3330",
#         "АМ214.80.160.3310",
#         "АМ214.80.160.3320",
#         "АМ214.80.160.3330",
#         "АМ214.80.40.3310",
#         "АМ214.80.40.3320",
#         "АМ214.80.40.3330",
#         "АМ214.80.63.3310",
#         "АМ214.80.63.3320",
#         "АМ214.80.63.3330"
#       ],
#       "Цена /шт. руб без НДС" : [
#         "104 005",
#         "104 338",
#         "105 703",
#         "105 911",
#         "106 757",
#         "106 909",
#         "108 176",
#         "109 832",
#         "109 882",
#         "111 869",
#         "112 688",
#         "114 183",
#         "115 011",
#         "118 041",
#         "121 849",
#         "122 307",
#         "122 349",
#         "122 350",
#         "122 717",
#         "125 048",
#         "129 117",
#         "129 985",
#         "134 942",
#         "135 496",
#         "136 904",
#         "137 718",
#         "141 832",
#         "142 599",
#         "145 289",
#         "148 032",
#         "149 125",
#         "151 491",
#         "152 343",
#         "154 184",
#         "154 545",
#         "154 950",
#         "156 053",
#         "157 516",
#         "158 915",
#         "159 136",
#         "161 783",
#         "163 889",
#         "163 975",
#         "164 150",
#         "166 652",
#         "168 573",
#         "169 597",
#         "170 168",
#         "172 887",
#         "173 785",
#         "174 008",
#         "174 190",
#         "175 339",
#         "176 456",
#         "176 597",
#         "177 744",
#         "178 257",
#         "182 563",
#         "183 942",
#         "185 489",
#         "186 182",
#         "187 999",
#         "188 031",
#         "190 298",
#         "191 930",
#         "192 132",
#         "192 623",
#         "193 057",
#         "194 277",
#         "197 860",
#         "198 870",
#         "199 368",
#         "201 566",
#         "202 418",
#         "205 452",
#         "205 689",
#         "207 290",
#         "209 091",
#         "213 276",
#         "216 817",
#         "218 237",
#         "218 750",
#         "219 414",
#         "220 281",
#         "220 535",
#         "224 662",
#         "227 913",
#         "228 700",
#         "229 736",
#         "230 433",
#         "232 055",
#         "232 589",
#         "232 646",
#         "234 695",
#         "242 987",
#         "242 989",
#         "245 403",
#         "247 067",
#         "250 206",
#         "254 783",
#         "261 478",
#         "273 234",
#         "274 249",
#         "275 236",
#         "276 319",
#         "278 600",
#         "280 706",
#         "282 403",
#         "287 574",
#         "290 765",
#         "292 547",
#         "296 181",
#         "297 732",
#         "300 308",
#         "300 550",
#         "304 005",
#         "304 793",
#         "310 403",
#         "316 200",
#         "317 997",
#         "323 421",
#         "323 747",
#         "329 543",
#         "330 621",
#         "331 035",
#         "331 967",
#         "333 871",
#         "340 473",
#         "341 135",
#         "341 905",
#         "352 374",
#         "353 189",
#         "368 508",
#         "371 254",
#         "376 639",
#         "378 148",
#         "382 846",
#         "383 438",
#         "385 567",
#         "393 929",
#         "394 553",
#         "401 264",
#         "404 863",
#         "406 664",
#         "418 378",
#         "433 155",
#         "436 636",
#         "438 514",
#         "454 930",
#         "456 663",
#         "462 182",
#         "466 896",
#         "467 411",
#         "49 957",
#         "496 825",
#         "498 701",
#         "498 793",
#         "500 596",
#         "507 484",
#         "518 627",
#         "519 254",
#         "534 827",
#         "535 346",
#         "54 682",
#         "543 841",
#         "56 802",
#         "564 354",
#         "568 267",
#         "589 453",
#         "59 225",
#         "59 817",
#         "591 531",
#         "594 078",
#         "61 587",
#         "64 157",
#         "65 642",
#         "66 413",
#         "68 112",
#         "68 762",
#         "68 922",
#         "72 493",
#         "72 785",
#         "743 339",
#         "75 659",
#         "753 639",
#         "76 879",
#         "77 163",
#         "78 057",
#         "78 669",
#         "78 783",
#         "783 455",
#         "795 628",
#         "80 943",
#         "82 104",
#         "83 028",
#         "85 231",
#         "851 153",
#         "859 145",
#         "862 245",
#         "873 329",
#         "88 393",
#         "89 801",
#         "91 263",
#         "91 711",
#         "91 793",
#         "92 317",
#         "926 235",
#         "93 362",
#         "93 603",
#         "939 343",
#         "94 141",
#         "94 739",
#         "944 788",
#         "95 864",
#         "952 908",
#         "964 163",
#         "97 137",
#         "97 531",
#         "98 573",
#         "980 926",
#         "99 061",
#         "99 497"
#       ],
#       "Цена /шт. руб с НДС 22%" : [
#         "1 038 406",
#         "1 048 156",
#         "1 051 939",
#         "1 065 462",
#         "1 130 006",
#         "1 145 999",
#         "1 152 641",
#         "1 162 547",
#         "1 176 278",
#         "1 196 730",
#         "100 167",
#         "101 294",
#         "103 982",
#         "107 839",
#         "109 558",
#         "111 341",
#         "111 887",
#         "111 988",
#         "112 626",
#         "113 902",
#         "114 195",
#         "114 852",
#         "115 582",
#         "116 955",
#         "118 507",
#         "118 988",
#         "120 260",
#         "120 855",
#         "121 387",
#         "126 886",
#         "127 293",
#         "128 958",
#         "129 211",
#         "130 243",
#         "130 429",
#         "131 975",
#         "133 995",
#         "134 057",
#         "136 480",
#         "137 480",
#         "139 304",
#         "140 313",
#         "144 010",
#         "148 656",
#         "149 214",
#         "149 266",
#         "149 267",
#         "149 715",
#         "152 559",
#         "157 523",
#         "158 581",
#         "164 629",
#         "165 305",
#         "167 023",
#         "168 015",
#         "173 035",
#         "173 971",
#         "177 252",
#         "180 599",
#         "181 932",
#         "184 819",
#         "185 859",
#         "188 104",
#         "188 545",
#         "189 038",
#         "190 385",
#         "192 169",
#         "193 877",
#         "194 146",
#         "197 376",
#         "199 945",
#         "200 050",
#         "200 263",
#         "203 315",
#         "205 659",
#         "206 908",
#         "207 605",
#         "210 922",
#         "212 018",
#         "212 290",
#         "212 512",
#         "213 913",
#         "215 276",
#         "215 449",
#         "216 847",
#         "217 473",
#         "222 727",
#         "224 410",
#         "226 297",
#         "227 142",
#         "229 359",
#         "229 398",
#         "232 163",
#         "234 155",
#         "234 401",
#         "235 001",
#         "235 529",
#         "237 017",
#         "241 389",
#         "242 622",
#         "243 229",
#         "245 910",
#         "246 950",
#         "250 651",
#         "250 940",
#         "252 894",
#         "255 091",
#         "260 196",
#         "264 517",
#         "266 249",
#         "266 875",
#         "267 685",
#         "268 743",
#         "269 053",
#         "274 088",
#         "278 054",
#         "279 014",
#         "280 277",
#         "281 128",
#         "283 108",
#         "283 759",
#         "283 828",
#         "286 327",
#         "296 444",
#         "296 446",
#         "299 391",
#         "301 422",
#         "305 251",
#         "310 836",
#         "319 003",
#         "333 346",
#         "334 584",
#         "335 788",
#         "337 109",
#         "339 892",
#         "342 461",
#         "344 532",
#         "350 840",
#         "354 733",
#         "356 907",
#         "361 341",
#         "363 234",
#         "366 376",
#         "366 671",
#         "370 886",
#         "371 847",
#         "378 691",
#         "385 764",
#         "387 957",
#         "394 574",
#         "394 971",
#         "402 043",
#         "403 358",
#         "403 863",
#         "405 000",
#         "407 322",
#         "415 377",
#         "416 184",
#         "417 124",
#         "429 896",
#         "430 890",
#         "449 580",
#         "452 930",
#         "459 500",
#         "461 340",
#         "467 072",
#         "467 795",
#         "470 391",
#         "480 593",
#         "481 355",
#         "489 542",
#         "493 933",
#         "496 130",
#         "510 421",
#         "528 449",
#         "532 697",
#         "534 987",
#         "555 015",
#         "557 129",
#         "563 863",
#         "569 613",
#         "570 241",
#         "60 947",
#         "606 127",
#         "608 415",
#         "608 527",
#         "610 727",
#         "619 131",
#         "632 725",
#         "633 489",
#         "652 488",
#         "653 122",
#         "66 713",
#         "663 486",
#         "688 511",
#         "69 299",
#         "693 286",
#         "719 132",
#         "72 254",
#         "72 977",
#         "721 668",
#         "724 775",
#         "75 136",
#         "78 272",
#         "80 083",
#         "81 024",
#         "83 096",
#         "83 889",
#         "84 085",
#         "88 442",
#         "88 797",
#         "906 873",
#         "919 439",
#         "92 304",
#         "93 793",
#         "94 139",
#         "95 229",
#         "95 976",
#         "955 815",
#         "96 115",
#         "970 666",
#         "98 751"
#       ]
# ]
# ```

# из шаблона нужно взять названия параметров, найти совпадение в исходных данных из документа, который я прислал,
# нужно выбрать одно значение из доступных (там где предлагается список), это значение должно соответствовать исходному или самое близкое к нему (если среди предложенных его нет),
# если параметра из шаблона нет в исходных данных - пропусти и переходи к следующему.

# результирующий json должен состоять из пар ключ - значение, где ключи - и значения взяты из шаблона в соответсвии с исходным файлом.
# в ответ пришли только json!
# """

# def recognize_text_from_file(file_path: str, credentials: str = None, model: str = "GigaChat-2") -> str | None:
#     file_path_obj = Path(file_path)
#     if not file_path_obj.exists():
#         raise FileNotFoundError(f"Файл {file_path} не найден")

#     allowed_extensions = ('.pdf', '.png', '.jpg', '.jpeg', '.tiff', '.bmp')
#     if file_path_obj.suffix.lower() not in allowed_extensions:
#         raise ValueError(f"Неподдерживаемый формат. Допустимы: {', '.join(allowed_extensions)}")

#     if credentials is None:
#         credentials = API_KEY
#         if not credentials:
#             raise ValueError("Укажите credentials или установите переменную окружения GIGACHAT_CREDENTIALS")

#     # Параметр verify_ssl_certs всё ещё нужен, чтобы клиент не пытался использовать внутренний сертификатный бандл
#     client = GigaChat(
#         credentials=credentials,
#         verify_ssl_certs=False,
#         model=model,
#         timeout=600
#     )

#     try:
#         with open(file_path_obj, "rb") as f:
#             uploaded_file = client.upload_file(f, purpose="general")
#         file_id = uploaded_file.id_
#         print(f"Файл успешно загружен. ID: {file_id}")

#         response = client.chat({
#             "messages" : [
#                 {
#                     "role": "user",
#                     "content": SUPER_PROMPT,
#                     "attachments": [file_id],
#                 }
#             ]
#         })

#         client.close()
#         if response and response.choices:

#             markdown = response.choices[0].message.content

#             return extract_any_json(markdown)

#         else:
#             return None
#     except Exception as e:
#         print(f"Ошибка обработки: {e}")
#         raise

# def extract_any_json(text):
#     # Находим самую внешнюю пару фигурных скобок — предполагаемый JSON-объект
#     braces_pattern = r'\{.*\}'
#     match = re.search(braces_pattern, text, re.DOTALL)
#     if match:
#         json_str = match.group()
#         try:
#             return json.loads(json_str)
#         except json.JSONDecodeError as e:
#             print(f"Ошибка парсинга JSON: {e}")
#             return None
#     else:
#         print("JSON-объект не найден")
#         return None

# @router.post("/upload_OL")
# async def upload_OL(file: UploadFile = File(...)) -> Dict[str, Any]:
#     """
#     Эндпоинт для загрузки файла.
#     Принимает файл, читает его метаданные и возвращает JSON.
#     """
#     try:
#         # Читаем первые 1024 байта для примера (можно убрать)
#         content_sample = await file.read(1024)
#         # Возвращаем указатель файла в начало, если нужно дальнейшее чтение
#         await file.seek(0)

#         print({
#             "filename": file.filename,
#             "content_type": file.content_type,
#             "size": len(content_sample),  # реальный размер требует полного чтения
#             "sample_bytes": content_sample.hex()[:100]  # первые байты в hex (для демонстрации)
#         })

#         file_path = f"../uploads/{file.filename}"
#         with open(file_path, "wb") as buffer:
#             shutil.copyfileobj(file.file, buffer)
            
#         # print(recognize_text_from_file(file_path))
#         # return recognize_text_from_file(file_path)

#         return {
#             # "Тип конструкции": "Клапан пружинный",
#             # "Номинальный диаметр": "100",
#             # "Номинальное давление": "16",
#             # "Тип присоединения к трубопроводу": "фланцевое",
#             # "Материал корпуса": "хладостойкая сталь (20ГЛ)",
#             "Маркировка": "АМ211.100.16.3330"
#         }

#     except Exception as e:
#         raise HTTPException(status_code=500, detail=f"Ошибка обработки файла: {str(e)}")

@router.post("/upload_OL")
async def upload_OL(
    product_id: int, 
    file: UploadFile = File(...),
    db: AsyncSession = Depends(get_db)
) -> Dict[str, Any]:
    try:
        params = await get_params_and_values_of_product(db, product_id)
        promt = get_promt(params)
        content = await convert_file_to_jpeg_content(file)
        if not content:
            return {"error": "Unsupported file format"}

        content.append({"type": "text", "text": promt})

        response = client.chat.completions.create(
            model=model_type,
            max_tokens=8000,
            messages=[{"role": "user", "content": content}],
            response_format={"type": "json_object"}
        )
        res = response.model_dump()
        need = res['choices'][0]['message']['content']
        parsed_need = json.loads(need)
        return parsed_need
    except HTTPException:
        raise
    except Exception as e:
        raise HTTPException(status_code=500, detail=f"Ошибка обработки файла: {str(e)}")
